case_up_half_cube_18/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       false;

// ============================================================
// USER PARAMETERS — the only section you need to edit
// ============================================================

// --- Nozzle centre (all refinement boxes are centred here) ---
nozzle_x    0.0;
nozzle_y    0.0;
nozzle_z    1.02;

// --- Domain extents (level-1 box is clamped to these) ---
domain_x_min   0.0;
domain_x_max  10.0;
domain_y_min  -6.0;
domain_y_max   6.0;
domain_z_min   0.0;
domain_z_max   8.0;

// --- Finest box HALF-sizes [m] (asymmetric, centred on nozzle) ---
//   Full finest box:  50 mm (x)  x  100 mm (y)  x  100 mm (z)
//   half = full / 2
finest_hx   0.05;   // half of 100 mm  in x
finest_hy   0.1;   // half of 200 mm in y
finest_hz   0.12;  // half of 240 mm in z

// --- Number of refinement levels n ---
//
//   Cell size at the finest level:
//     dx_finest = dx_blockMesh / 2^(n-1)
//
//   With dx_blockMesh = 0.5 m, target dx ~ 20 mm:
//     n = ceil( log2(0.5 / 0.020) ) + 1  =  ceil(4.64) + 1  =  6
//     -> dx_finest = 0.5 / 2^5 = 15.6 mm  (nearest achievable below 20 mm)
//
//   Quick reference (dx_blockMesh = 0.5 m):
//     n = 4  ->  62.5 mm
//     n = 5  ->  31.3 mm
//     n = 6  ->  15.6 mm   <-- current setting
//     n = 7  ->   7.8 mm
//
//   NOTE: increasing n by 1 roughly multiplies cell count near the nozzle
//   by 8 (factor of 2 in each of 3 directions).
//
n   6; //8;

// --- Growth factor between shells ---
//   Half-size of level k  =  finest_h* * growth_factor^(n - k)
//   With 2.0 each shell doubles in linear size (8x volume) going outward.
growth_factor   2.0;

// --- Base snappy refinement level for the coarsest box (level 1) ---
//   Level-k box receives snappy level  base_refinement + (k - 1)
//   so the finest box (level n) receives  base_refinement + n - 1
base_refinement   1;

// ============================================================
// COMPUTED COORDINATES — do not edit below this line
//
//   All box half-sizes are derived from finest_h* by repeated
//   multiplication by growth_factor, going from level n down to level 2.
//   Level 1 is always clamped to domain_* extents.
//
//   With n=6, finest_hx=0.025, finest_hy=0.050, finest_hz=0.050, factor=2:
//
//   level  snappy  hx [mm]  hy [mm]  hz [mm]  full box [mm]
//   -----  ------  -------  -------  -------  --------------------
//     6      6       25       50       50      50 x 100 x 100
//     5      5       50      100      100     100 x 200 x 200
//     4      4      100      200      200     200 x 400 x 400
//     3      3      200      400      400     400 x 800 x 800
//     2      2      400      800      800     800 x 1600 x 1600
//     1      1      clamped to domain extents
// ============================================================

// --- Level n (finest) ---
ln_hx    $finest_hx;
ln_hy    $finest_hy;
ln_hz    $finest_hz;
ln_xmin  #calc "$nozzle_x - $ln_hx";
ln_xmax  #calc "$nozzle_x + $ln_hx";
ln_ymin  #calc "$nozzle_y - $ln_hy";
ln_ymax  #calc "$nozzle_y + $ln_hy";
ln_zmin  #calc "$nozzle_z - $ln_hz";
ln_zmax  #calc "$nozzle_z + $ln_hz";
ln_level #calc "$base_refinement + $n - 1";

// --- Level n-1 ---
lnm1_hx    #calc "$ln_hx * $growth_factor";
lnm1_hy    #calc "$ln_hy * $growth_factor";
lnm1_hz    #calc "$ln_hz * $growth_factor";
lnm1_xmin  #calc "$nozzle_x - $lnm1_hx";
lnm1_xmax  #calc "$nozzle_x + $lnm1_hx";
lnm1_ymin  #calc "$nozzle_y - $lnm1_hy";
lnm1_ymax  #calc "$nozzle_y + $lnm1_hy";
lnm1_zmin  #calc "$nozzle_z - $lnm1_hz";
lnm1_zmax  #calc "$nozzle_z + $lnm1_hz";
lnm1_level #calc "$base_refinement + $n - 2";

// --- Level n-2 ---
lnm2_hx    #calc "$lnm1_hx * $growth_factor";
lnm2_hy    #calc "$lnm1_hy * $growth_factor";
lnm2_hz    #calc "$lnm1_hz * $growth_factor";
lnm2_xmin  #calc "$nozzle_x - $lnm2_hx";
lnm2_xmax  #calc "$nozzle_x + $lnm2_hx";
lnm2_ymin  #calc "$nozzle_y - $lnm2_hy";
lnm2_ymax  #calc "$nozzle_y + $lnm2_hy";
lnm2_zmin  #calc "$nozzle_z - $lnm2_hz";
lnm2_zmax  #calc "$nozzle_z + $lnm2_hz";
lnm2_level #calc "$base_refinement + $n - 3";

// --- Level n-3 ---
lnm3_hx    #calc "$lnm2_hx * $growth_factor";
lnm3_hy    #calc "$lnm2_hy * $growth_factor";
lnm3_hz    #calc "$lnm2_hz * $growth_factor";
lnm3_xmin  #calc "$nozzle_x - $lnm3_hx";
lnm3_xmax  #calc "$nozzle_x + $lnm3_hx";
lnm3_ymin  #calc "$nozzle_y - $lnm3_hy";
lnm3_ymax  #calc "$nozzle_y + $lnm3_hy";
lnm3_zmin  #calc "$nozzle_z - $lnm3_hz";
lnm3_zmax  #calc "$nozzle_z + $lnm3_hz";
lnm3_level #calc "$base_refinement + $n - 4";

// --- Level n-4 ---
lnm4_hx    #calc "$lnm3_hx * $growth_factor";
lnm4_hy    #calc "$lnm3_hy * $growth_factor";
lnm4_hz    #calc "$lnm3_hz * $growth_factor";
lnm4_xmin  #calc "$nozzle_x - $lnm4_hx";
lnm4_xmax  #calc "$nozzle_x + $lnm4_hx";
lnm4_ymin  #calc "$nozzle_y - $lnm4_hy";
lnm4_ymax  #calc "$nozzle_y + $lnm4_hy";
lnm4_zmin  #calc "$nozzle_z - $lnm4_hz";
lnm4_zmax  #calc "$nozzle_z + $lnm4_hz";
lnm4_level #calc "$base_refinement + $n - 5";

// --- Level 1 (coarsest — always the full domain) ---
l1_level   $base_refinement;


// ============================================================
//  GEOMETRY
// ============================================================
geometry
{
    V_room_m.stl
    {
        type triSurfaceMesh;
        name walls;
    }

    nozzle_m.stl
    {
        type triSurfaceMesh;
        name nozzle_wall;
    }

    // ----------------------------------------------------------
    // Nested refinement boxes centred on the nozzle.
    //
    // Boxes are named by their offset from n (the finest level):
    //   refinementBox_n    = level n   (finest)
    //   refinementBox_nm1  = level n-1
    //   ...
    //   refinementBox_nm4  = level n-4
    //   refinementBox_1    = level 1   (coarsest, full domain)
    //
    // To add more levels: duplicate a block, rename nm4 -> nm5,
    // add lnm5_* variables following the same #calc pattern above,
    // and increment n.
    // ----------------------------------------------------------

    // Level 1 — full domain
    refinementBox_1
    {
        type box;
        min  ($domain_x_min  $domain_y_min  $domain_z_min);
        max  ($domain_x_max  $domain_y_max  $domain_z_max);
    }

    // Level n-4  (= level 2 when n=6)
    //   hx=400 mm  hy=800 mm  hz=800 mm
    refinementBox_nm4
    {
        type box;
        min  ($lnm4_xmin  $lnm4_ymin  $lnm4_zmin);
        max  ($lnm4_xmax  $lnm4_ymax  $lnm4_zmax);
    }

    // Level n-3  (= level 3 when n=6)
    //   hx=200 mm  hy=400 mm  hz=400 mm
    refinementBox_nm3
    {
        type box;
        min  ($lnm3_xmin  $lnm3_ymin  $lnm3_zmin);
        max  ($lnm3_xmax  $lnm3_ymax  $lnm3_zmax);
    }

    // Level n-2  (= level 4 when n=6)
    //   hx=100 mm  hy=200 mm  hz=200 mm
    refinementBox_nm2
    {
        type box;
        min  ($lnm2_xmin  $lnm2_ymin  $lnm2_zmin);
        max  ($lnm2_xmax  $lnm2_ymax  $lnm2_zmax);
    }

    // Level n-1  (= level 5 when n=6)
    //   hx=50 mm  hy=100 mm  hz=100 mm
    refinementBox_nm1
    {
        type box;
        min  ($lnm1_xmin  $lnm1_ymin  $lnm1_zmin);
        max  ($lnm1_xmax  $lnm1_ymax  $lnm1_zmax);
    }

    // Level n — finest  (= level 6 when n=6)
    //   Full box: 50 mm (x) x 100 mm (y) x 100 mm (z)
    refinementBox_n
    {
        type box;
        min  ($ln_xmin  $ln_ymin  $ln_zmin);
        max  ($ln_xmax  $ln_ymax  $ln_zmax);
    }
}


// ============================================================
//  CASTELLATED MESH CONTROLS
// ============================================================
castellatedMeshControls
{
    maxLocalCells   100000;
    maxGlobalCells  2000000;
    minRefinementCells 0;
    nCellsBetweenLevels 3;

    features
    (
        {
            file "V_room_m.eMesh";
            level 2;
        }
        {
            file "nozzle_m.eMesh";
            level $ln_level;
        }  
    );

    refinementSurfaces
    {
        walls
        {
            level (2 2);
        }

        nozzle_wall
        {
            // Surface snapped to finest box level
            level ($ln_level $ln_level);
        }
    }

    resolveFeatureAngle 10;

    refinementRegions
    {
        // Listed from coarsest to finest; each inner box overrides the outer.

        refinementBox_1
        {
            mode inside;
            levels (($l1_level $l1_level));
        }

        refinementBox_nm4
        {
            mode inside;
            levels (($lnm4_level $lnm4_level));
        }

        refinementBox_nm3
        {
            mode inside;
            levels (($lnm3_level $lnm3_level));
        }

        refinementBox_nm2
        {
            mode inside;
            levels (($lnm2_level $lnm2_level));
        }

        refinementBox_nm1
        {
            mode inside;
            levels (($lnm1_level $lnm1_level));
        }

        refinementBox_n
        {
            mode inside;
            levels (($ln_level $ln_level));
        }
    }

    locationInMesh (1.23 0.17 1.37);   // point inside mesh, outside all STLs

    allowFreeStandingZoneFaces false;
}


// ============================================================
//  SNAP CONTROLS
// ============================================================
snapControls
{
    nSmoothPatch    3;
    tolerance       1.0; //0.5;   // reduced from 1.0 to limit sliver cells during snap
    nSolveIter      300;
    nRelaxIter      5;

    nFeatureSnapIter        10;
    implicitFeatureSnap     false;
    explicitFeatureSnap     true;
    multiRegionFeatureSnap  false;
}


// ============================================================
//  ADD LAYERS CONTROLS  (disabled)
// ============================================================
addLayersControls
{
    relativeSizes true;

    layers
    {
    }

    expansionRatio          1.0;
    finalLayerThickness     0.25;
    minThickness            0.2;
    nGrow                   0;

    featureAngle            30;
    nRelaxIter              5;
    nSmoothSurfaceNormals   1;
    nSmoothNormals          3;
    nSmoothThickness        10;
    maxFaceThicknessRatio   0.5;
    maxThicknessToMedialRatio 0.3;
    minMedialAxisAngle      90;
    nBufferCellsNoExtrude   0;
    nLayerIter              50;
    nRelaxedIter            20;
}


// ============================================================
//  MESH QUALITY CONTROLS
// ============================================================
meshQualityControls
{
    #include "meshQualityDict"

    relaxed
    {
        maxNonOrtho 75;
    }

    nSmoothScale    4;
    errorReduction  0.75;
}

writeFlags
(
    scalarLevels
    layerSets
    layerFields
);

mergeTolerance 1E-6;

// ************************************************************************* //
